const condition = [
  'Новая с биркой',
  'Новая без бирки',
  'Есть дефекты',
  'Надевалась один раз',
  'Надевалась несколько раз',
];

const optionsSexCategory = ['Мужской', 'Женский'];

const category = ['Обувь', 'Одежда', 'Верх', 'Низ', 'Аксессуары'];

const dataFilter = {
  size: [{
    title: 'Обувь',
    /* eslint-disable-next-line */
    data: ['4 US', '4.5 US', '5 US', '5.5 US', '6 US', '6.5 US', '7 US', '7.5 US', '8.5 US', '9 US', '9.5 US', '10 US', '10.5 US', '11 US', '11.5 US', '12 US', '12.5 US', '13 US', '13.5 US', '14 US', '14.5 US'],
  },
  {
    title: 'Одежда',
    /* eslint-disable-next-line */
    data: ['XXS', 'XS', 'S', 'M', 'L', 'XL', 'XXL'],
  },
  {
    title: 'Низ',
    /* eslint-disable-next-line */
    data: ['one size', '26 US', '27 US', '28 US', '29 US', '30 US', '31 US', '32 US', '33 US', '34 US', '35 US', '36 US', '37 US', '38 US', '39 US', '40 US', '41 US', '42 US', '43 US', '44 US', '45 US', '46 US'],

  },
  {
    title: 'Аксессуары',
    /* eslint-disable-next-line */
    data: ['one size', '26 US', '27 US', '28 US', '29 US', '30 US', '31 US', '32 US', '33 US', '34 US', '35 US', '36 US', '37 US', '38 US', '39 US', '40 US', '41 US', '42 US', '43 US', '44 US', '45 US', '46 US'],
  }],
  categoryMan: [{
    title: 'Аксессуары',
    /* eslint-disable-next-line */
    data: ['Наручные часы', 'Шапки', 'Шарфы', 'Панамы', 'Кепки', 'Ремни', 'Носки', 'Солнцезащитные очки', 'Сумки', 'Рюкзаки', 'Кошельки', 'Другое'],
  },
  {
    title: 'Обувь',
    data: ['Кроссовки', 'Ботинки', 'Кеды', 'Сандалии', 'Сланцы'],
  },
  {
    title: 'Верхняя одежда',
    /* eslint-disable-next-line */
    data: ['Бомберы', 'Джинсовые куртки', 'Анораки', 'Парки', 'Ветровки', 'Пиджаки', 'Кожаные куртки', 'Плащи', 'Жилеты', 'Куртки'],
  },
  {
    title: 'Верх',
    data: ['Cвитера', 'Кардиганы', 'Свитшоты', 'Олимпийки', 'Рубашки', 'Лонгсливы', 'Поло', 'Футболки', 'Худи'],
  },
  {
    title: 'Низ',
    data: ['Джинсы', 'Брюки', 'Шорты', 'Спортивные штаны', 'Плавки'],
  }],
  categoryWoman: [
    {
      title: 'Аксессуары',
      /* eslint-disable-next-line */
      data: ['Наручные часы', 'Шапки', 'Шарфы', 'Панамы', 'Кепки', 'Ремни', 'Носки', 'Солнцезащитные очки', 'Сумки', 'Рюкзаки', 'Кошельки', 'Другое'],
    },
    {
      title: 'Обувь',
      data: ['Кроссовки', 'Ботинки', 'Кеды', 'Сандалии', 'Сланцы'],
    },
    {
      title: 'Верхняя одежда',
      /* eslint-disable-next-line */
      data: ['Бомберы', 'Джинсовые куртки', 'Анораки', 'Парки', 'Ветровки', 'Пиджаки', 'Кожаные куртки', 'Плащи', 'Жилеты', 'Куртки'],
    },
    {
      title: 'Верх',
      /* eslint-disable-next-line */
      data: ['Cвитера', 'Кардиганы', 'Свитшоты', 'Олимпийки', 'Рубашки', 'Лонгсливы', 'Поло', 'Футболки', 'Худи', 'Платья'],
    },
    {
      title: 'Низ',
      data: ['Джинсы', 'Брюки', 'Шорты', 'Спортивные штаны', 'Плавки', 'Юбки'],
    },
  ],
};

export {
  condition,
  optionsSexCategory,
  category,
  dataFilter,
};
